package quiz01;

public class RandomLotto {
	public static void main(String[] args) {
		/* 남는 시간에 한 번 해보기.
		 * 무작위로 생성된 로또번호를 이용하여 당첨되기까지 금액을 알아보는 프로그램입니다.
		 * 
		 * 1. 입력: x
		 * 2. 출력: 길이가 6인 배열
		 * lotto함수는 1~45까지의 중복되지 않는 랜덤수를 배열에 넣어 반환하는 매서드입니다.
		 * 이 매서드의 실행 결과는 당첨번호가 됩니다.
		 * 
		 * 3.입력 - 당첨배열
		 * 4.출력 - long(당첨되기까지의 금액)
		 * 
		 * run함수는 당첨배열을 받아서 당첨되기까지 랜덤한 금액을 계산하는 매서드입니다.
		 * ******당첨의 조건******
		 * 당첨번호: [10,9,8,7,6,5]
		 * ex)[5,6,8,7,9,10]  당첨
		 * ex)[10,9,8,7,6,45] 당첨X
		 */
		
	}
}
